<template>
  <div id="main">
    <div class="main-wrap">
      <TopNavbar></TopNavbar>
      <RightSide></RightSide>
      <LeftSide></LeftSide>

      <div id="story">
        <div class="story-wrap">
          <div class="story-text" v-for="storyKey in story" :key="storyKey">
            <h2>{{ storyKey.title }}</h2>
            <p>{{ storyKey.content }}</p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import TopNavbar from '@/components/TopNavbar'
import LeftSide from '@/components/LeftSide'
import RightSide from '@/components/RightSide'

export default {
  components: {
    TopNavbar,
    LeftSide,
    RightSide
  },
  data () {
    return {
      story: {
        partOne: {
          title: '第一章 前言',
          content: `
            結束日本殖民時期的台灣，此時台灣人的認知及價值觀，已與戰後中國移民有明顯的差距。相對地，戰後中國移民及政府官員對台灣的情形，亦非常陌生，加上當時中國內陸戡亂情勢日趨惡化，政府自然沒有心力對台灣付出更多的關懷，而主政者不能體察民情，還在政治上打壓台籍人士。
            天這麼黑，為什麼爸爸還不回家……
            躺在床上翻來覆去，眼睛直愣愣地盯著天花板，臉上全是擔憂，今夜又是個失眠夜，害怕又夢到地上佈滿鮮血，無辜的人民在路上逃竄。
            更害怕夢境中爸爸在街上消逝的身影變真實。
            第二次世界大戰剛結束，滿地的鮮血與屍體還深深印烙在人們的心裡，大家都害怕再有戰爭發生，「生靈塗炭」是我腦海中唯一想到的詞。或許在這個世代，不信任人心才是對的，一點風聲草動，都有著足以威脅自己生命的事情發生，寧願錯殺一百也不願放過一個……
            `
        },
        partTwo: {
          title: '第二章  導火線',
          content: `
            我的爸爸是當時小有名氣的律師，那天有位醫師協會的人跑來找爸爸，臉上寫滿了憂愁，苦苦的哀求爸爸為他打官司。
            原來這家醫院為一位軍官的妻子開刀，但不幸的是，妻子因為藥物反應不良而撒手人寰，軍官怒氣沖天，無法原諒這家醫院，也不能相信妻子就此逝去的事實，因此憤而對這家醫院提告。
            爸爸的直率、正直是眾所皆知的，因此當其他律師都害怕得罪國家的同時，爸爸接下了這樁案子，為了追求正義。藥物的反應不良是不可抗力的死亡原因，爸爸在法官面前堅持著這個因素，為醫師協會打了場勝仗，但卻為自己埋下逃亡的伏筆……
            `
        },
        partThree: {
          title: '第三章  經過',
          content: `
            1947年黑暗的序幕被掀開，一樁樁台灣人被莫須有的罪名而送入大牢，甚至死亡的冤案發生了，爸爸雖心有不滿，但為了家人的安全並沒有太張揚，只是安靜地過日子。
            有一天，爸爸的友人—楊叔叔來家裡找他，相談甚歡，吃著食物喝著酒，日子看起來平凡而快樂。正當話題十分盡興時，猝不及防地，門被硬生生踢開，為軍官夫人執刀的那名醫生急忙地跑進來，拉著爸爸就要跑，大家都被他搞的一頭霧水。

            醫生：「快走！不然就來不及了。」
            爸爸：「到底怎麼回事，你一進門就拽著我走。」
            醫生：「我也不想啊，但李律師您救過我，我不能這樣見死不救，更何況這件事算是因我而起。」
            爸爸一臉震驚，大概猜想到是怎麼回事了，但誰也沒想到平凡的日子裡，會有人衝進家門口對自己說有生命危險。
            爸爸：「你說清楚一點。」
            醫生：「來不及了，我們先走，路上再跟你說。」
            爸爸被醫生拉走，離開了這個家。

            在爸爸離開後的幾分鐘，果不其然，一位軍官大搖大擺地進入家中，看了看我們的房子，一出口便要大批軍人搜我們家。
            媽媽：「這是怎麼回事，這位軍官，你突然到我們家來搜查，有法律依據嗎？」
            軍官藐視地看著母親：「法律？李瑞和打錯官司，掩蔽罪人，讓那家破醫院判定無罪，是重要犯人，我要將他緝拿到案。」
            一名軍人來報，搜盡家中沒有找到爸爸。這是理所當然的，因為爸爸早就跑了。
            楊叔叔：「你這根本是莫須有的罪名，有沒有罪不是你決定的。」
            軍官：「你是誰？也敢這樣跟我講話！」
            媽媽趕緊攬住楊叔叔，希望他不要為了替爸爸出氣而得罪軍官。

            媽媽：「不管有沒有罪，我丈夫現在外出了，有什麼事我們法庭上再談。」
            軍官：「是不是外出等我抓到他就知道了。 來人，把這個出口不遜的人綁回去。而妳，告訴李瑞和最好不要搞什麼花招，乖乖認罪。」
            軍官帶走楊叔叔與大批人馬，留下擔心受怕的母親與混亂不堪的房子……
            那時我在學校上學，這些事是回家後母親流著淚告訴我的，我很難再見到爸爸了。
          `
        },
        partFour: {
          title: '第四章  逃亡',
          content: `
            「要去哪裡？」我的腦袋裡一片空白，只有剛剛發生的事還回盪在腦海中，我急切地抓住這位年輕的醫生，只想趕快弄清楚發生什麼事。
            「真的很抱歉…但我也是逼不得已的」醫生滿懷愧疚地說出，軍官曾跑來醫院嗆聲，以及醫院的長官是如何把事情推給他的。律師救了自己，但自己卻害他陷入危險，因此一聽到軍官往律師家方向去之後，這位年輕的醫師便決定放下自己大好的前程，無論如何也要救這位救命恩人。
          
            大量的資訊困擾著思緒，震驚顯露在臉上，緊接著的是竄上全身的害怕。
            「我的家人！」轉身就想要跑回家裡，保護自己的妻子，但迅即被醫師抓住，「冷靜點，他們的目標是你，不是你的家人，你現在跑回去是自投羅網」。
            我扶著額頭、腳步踉蹌，彷彿要被這個天大的消息壓垮，醫生急切地扶住我，安慰地說「我們必須先逃跑，活下去，才有希望」
            明白事情已經無轉圜餘地，在這個時代，我註定是逃犯。一開始我們只想要逃，接應我們的家人，離開台灣，但政府的力量滲透全台各地，讓我們去哪都不方便。
          `
        },
        partFive: {
          title: ' 第五章  起義',
          content: `
            一旦明白這件事後，我心想，那只剩一個選擇了，我們決定起義，為自由努力一次。
            228事件爆發後，冤案不斷發生，因此對政府不滿的人比比皆是，我不斷拉攏那些人，讓自己的組織越來越龐大，組織名稱是「末班」，忠誠於組織的人們，有一個絕對不能交出去的東西，那就是名單，上面記載了所有參加末班的人員名字，一旦曝光，所有的人都將死在國家手上，無一倖免。
          `
        }
      }
    }
  }
}
</script>
